Repository: Tornevall/tornevalls-resurs-bank-payment-gateway-for-woocommerce
Catalog: language/tornevalls-resurs-bank-payment-gateway-for-woocommerce-*.po
Languages: sv_se

source: Plugin and account settings
sv_se: Plugin- och kontoinställningar

source: Address block from Resurs Checkout is empty!
sv_se: Adressblocket från Resurs Checkout är tomt!

source: Resurs Bank Payment Gateway with dynamic payment methods.
sv_se: Resurs Bank betalnings-gateway med dynamiska betalsätt.

source: An error (%s, code %s) occurred during the iframe creation. Retrying with a new payment id.
sv_se: Ett fel (%s, kod %s) inträffade när iframe skulle skapas. Försöker igen med ett nytt betalnings-id.

source: Base URL for signing: %s
sv_se: Bas-URL för signering: %s

source: Signing parameters for %s: %s
sv_se: Signeringsparametrar för %s: %s

source: %s: Could not create order from an empty cart.
sv_se: %s: Det gick inte att skapa order från en tom kundvagn.

source: Cart is empty!
sv_se: Varukorgen är tom!

source: Reusing preferred payment id "%s" for customer, age %d seconds old.
sv_se: Återanvänder föredraget betalningsid "%s" för kund, ålder %d sekunder gammal.

source: Preferred payment id set to "%s" for customer.
sv_se: Föredraget betalningsid s på "%s" för kunden.

source: Article description is missing.
sv_se: Artikelbeskrivning saknas.

source: Order process initialized by customer with checkout %s.
sv_se: Orderprocessen initieras av kunden med %s.

source: Order reference updated (updatePaymentReference) with no errors.
sv_se: Orderreferensen har uppdaterats (updatePaymentReference) utan fel.

source: Order reference not updated: Reference is already updated.
sv_se: Orderreferensen har inte uppdaterats: Referensen har redan uppdaterats.

source: updatePaymentReference failure (code %s): %s.
sv_se: updatePaymentReference-fel (kod %s): %s.

source: Resurs Bank processing order (%s).
sv_se: Resurs Bank behandlar order (%s).

source: %s: Initialize Resurs Bank process, order %s (%s) via %s.
sv_se: %s: Initierar Resurs Bank-procedur, order %s (%s) via %s.

source: Chosen checkout type is currently unsupported
sv_se: Vald utcheckningstyp stöds för närvarande inte

source: %s: Order %s returned "%s" to WooCommerce.
sv_se: %s: Order %s returnerades %s till WooCommerce.

source: $return is not an object as expected in function %s (Checkout request type is %s).
sv_se: $return är inte ett objekt som förväntat i funktion %s (Checkout-typ är %s).

source: API data request: %s.
sv_se: API-databegäran: %s.

source: Customer returned from Resurs Bank. WooCommerce order validation in progress.
sv_se: Kund återvände från Resurs Bank. Ordervalidering från WooCommerce pågår.

source: wc_order_id + preferred_id not present
sv_se: wc_order_id + preferred_id saknas

source: Session value rco_order_id has been reset after successful return to landing page.
sv_se: Sessionsvärdet rco_order_id har återställts efter lyckad återgång till landningssidan.

source: Finishing. Ready to redirect customer. Using URL %s
sv_se: Avslutar. Redo att omdirigera kunden. Använder URL %s

source: Customer returned from Resurs Bank to complete order %s.
sv_se: Kunden återvände från Resurs Bank för att slutföra order %s.

source: Order is debited and completed.
sv_se: Beställningen är debiterad och slutförd.

source: Order is booked and ready to handle.
sv_se: Beställningen är bokad och klar att hantera.

source: Order is frozen and waiting for manual inspection.
sv_se: Beställningen är frusen och väntar på manuell inspektion.

source: Resurs Bank requires external handling/signing on this order. Customer redirected.
sv_se: Resurs Bank kräver extrahantering/signering av ordern. Kunden omdirigeras.

source: The booking failed with status %s. Customer notified in checkout.
sv_se: Bokningen misslyckades med status %s. Kunden meddelas i kassan.

source: The payment can not complete. Contact customer services for more information.
sv_se: Ordern kan inte slutföras. Kontakta kundservice för mer information.

source: Booking this signed payment has been running multiple times but failed with exception %s.
sv_se: Bokningen av den här signerade betalningen har pågått flera gånger men misslyckades med fel %s.

source: Tried to book signed payment but skipped: This has happened before and an exception with code %d occurred that time.
sv_se: Försökte boka signerad betalning men hoppades över: Detta har gjorts tidigare och ett fel med kod %d inträffade den gången.

source: Could not complete your order. Please contact support for more information.
sv_se: Det gick inte att slutföra din beställning. Vänligen kontakta supporten för mer information.

source: Could not complete order due to signing problems.
sv_se: Det gick inte att slutföra ordern på grund av signeringsproblem.

source: Customer returned via urlType "%s" - failed or cancelled payment (signing required: %s).
sv_se: Kunden returnerades via urltyp "%s" - misslyckades eller avbröt betalningen (signering krävdes: %s).

source: Yes
sv_se: Ja

source: No
sv_se: Nej

source: Resurs Bank price information is currently unavailable right now, due to timed out connection. Please try again in a moment.
sv_se: Resurs Banks prisinformation är för närvarande inte tillgänglig på grund av time out mot anslutningen. Försök igen om ett ögonblick.

source: Part pay from %s per month. | %s
sv_se: Delbetala från %s per månad. | %s

source: Read more.
sv_se: Läs mer.

source: Original Plugin Documentation
sv_se: Ursprunglig plugindokumentation

source: Your system has crypto support but currently you are using the deprecated module mcrypt for it. It is strongly recommended to upgrade to a modern package as soon as possible.
sv_se: Ditt system har kryptostöd, men för närvarande använder du den föråldrade modulen mcrypt för det. Det rekommenderas starkt att uppgraderar till ett modernt paket så snart som möjligt.

source: Your system is missing support for crypto. This module may not work properly without it!
sv_se: Ditt system saknar stöd för krypto. Modulen kanske inte fungerar korrekt utan det!

source: %s, at least %s are required.
sv_se: %s, åtminstone %s krävs.

source: Webservice Library
sv_se: Webservice-Bibliotek

source: Communication Library
sv_se: Kommunikationsbibliotek

source: Communication Drivers
sv_se: Kommunikations-drivrutiner

source: Crypto Library
sv_se: Kryptobibliotek

source: Network Lookup
sv_se: Nätverksuppslag

source: If something is wrong and you are unsure of where to begin, take a look at the communication drivers. Wrappers that must be available for this plugin to fully work, is either the CurlWrapper or SimpleStreamWrapper -and- the SoapClientWrapper. Resurs Bank offers multiple services over both Soap/XML and REST so they have to be present.
sv_se: Om något är fel och du är osäker på var du ska börja, ta dig en titt på kommunikations-drivrutinerna. Wrappers som måste vara tillgängliga för att pluginet skall fungera fullt ut, är antingen CurlWrapper eller SimpleStreamWrapper -och- SoapClientWrapper. Resurs Bank erbjuder flera olika tjänster över både Soap/XML och REST, så de måste finnas tillgängliga.

source: If you ever need support with this plugin, you should primarily check this page before sending support requests. When you send the requests, make sure you do include the information below in your message. Doing this, it will be easier in the end to help you out.
sv_se: Om du någon gång behöver support med detta pluginet, bör du primärt titta till den här sidan innan du skickar support-ärenden. När du skickar ärenden, se till att du inkluderar så mycket information som möjligt från nedan, i ditt meddelande. Om du gör detta, blir det i slutänden mycket lättare att hjälpa dig.

source: %s failed encryption (%d): %s. Failover to base64.
sv_se: %s misslyckade kryptering (%d): %s. Redundansväxling till bas64.

source: DevLog Method "%s" message: %s.
sv_se: DevLog-funktion "%s" meddelande: %s.

source: An error occurred during the payment information retrieval from Resurs Bank so we can not show the current order status for the moment.
sv_se: Ett fel uppstod under tiden som betalningsinformationen skulle tas emot från Resurs Bank så vi kan för närvarande inte visa nuvarande orderstatus.

source: %s internal generic exception %s from function %s: %s --- File %s, line %s.
sv_se: %s internt generiskt undantag %s från funktion %s: %s --- Fil %s, rad %s.

source: %s internal generic exception %s: %s --- File %s, line %s.
sv_se: %s internt generellt undantagsfel %s: %s --- Fil %s, rad %s.

source: Unable to update order meta in %s - object $order is of wrong type or not an integer.
sv_se: Kan ej uppdatera order-meta i %s - objektet $order är av fel typ eller inte ett heltal.

source: Number of decimals headsup message
sv_se: Antal decimaler - Observera

source: Received an error message from Resurs Bank that indicates that you credentials are incorrect.
sv_se: Fick ett felmeddelande från Resurs Bank som indikerar att dina autentiseringsuppgifter är felaktiga.

source: Basic Resurs Bank API Settings
sv_se: Inställningar för Resurs Bank API

source: Enable plugin checkout functions
sv_se: Aktivera pluginfunktioner för kassa

source: Enabled
sv_se: Aktiverad

source: Enable Resurs Bank
sv_se: Aktivera Resurs Bank

source: This enables core functions of Resurs Bank, like the payment gateway, etc. When disabled, after shop functions (i.e. debiting, annulling, etc) will still work.
sv_se: Detta aktiverar kärnfunktionerna för Resurs Bank. exempelvis betalnings-gatewayen, med mera. När den är avstängd så kommer efterköps-funktioner (såsom debitering, annullering, mfl) fortfarande fungera.

source: Checkout Type
sv_se: Kassa-Typ

source: Resurs Checkout (embedded checkout by iframe)
sv_se: Resurs Checkout (inbäddad utcheckning med hjälp av iframe)

source: Integrated Checkout (simplified shopFlow)
sv_se: Integrerad kassa (simplified shopflow)

source: Hosted Checkout
sv_se: Hostad kassa

source: Chosen checkout type.
sv_se: Vald kassatyp.

source: Internal Tax Class
sv_se: Interna momsklasser

source: Tax class to use when nothing else is specified (for example, on payment fees).
sv_se: Momsklass att använda när inget annat anges (till exempel på betalavgifter).

source: Environment
sv_se: Miljö

source: Production
sv_se: Produktion

source: Defines if you are are live or just in test/staging. Default: test.
sv_se: Definierar om du är live eller enbart i test/staging. Standard: test.

source: Username
sv_se: Användarnamn

source: Web services username, received from Resurs Bank.
sv_se: Webservicens användarnamn, vilket du erhållit från Resurs Bank.

source: Username (Production).
sv_se: Användarnamn (Produktion).

source: Resurs Bank API password
sv_se: Lösenord för Resurs Bank-API

source: API password, received from Resurs Bank. If your credentials are saved within the same environment as the chosen one and you decide to validate them before saving, payment methods and necessary data will update the same time. Otherwise, only credentials will be saved.
sv_se: API-lösenord, mottaget från Resurs Bank. Om dina autentiseringsuppgifter sparas mot samma miljö som den valda och du bestämmer dig för att validera dem innan du sparar, uppdateras betalningsmetoder och nödvändiga data samtidigt. Annars sparas bara autentiseringsuppgifterna.

source: Resurs Bank API Password (Production).
sv_se: Lösenord för Resurs Bank-API (Produktion).

source: API password, received from Resurs Bank. To validate and store the credentials make sure you use the validation button. If you choose to not validate your credentials here, and instead just save, you have to update the methods manually in the payment methods section.
sv_se: API-lösenord, mottaget från Resurs Bank. För att validera och lagra autentiseringsuppgifterna se till att du använder verifieringsknappen. Om du väljer att inte validera dina autentiseringsuppgifter här, och i stället bara spara, måste du uppdatera metoderna manuellt i sektionen för betalningsmetoder.

source: Chosen merchant country
sv_se: Valt handelsland

source: Defines which country this plugin operates from. Credentials given by Resurs Bank are limited to a specific country. Default: Store address country.
sv_se: Definierar vilket land detta plugin opererar från. Användaruppgifter som erhålls från Resurs Bank begränsas till ett specifikt land. Standard: Butiksadressens land.

source: Enable extended test mode
sv_se: Aktivera utökat testläge

source: Extended help when test is enabled
sv_se: Utökad hjälp när test är aktiverat

source: Activates helping functions that makes life easier when testing.
sv_se: Aktiverar hjälpfunktioner som gör livet enklare vid testning.

source: Payment methods and order handling
sv_se: Betalningsmetoder och orderhantering

source: Payment methods, products and checkout
sv_se: Betalningsmetoder, produkter och kassa

source: This section covers information for your current payment methods that is linked with your API settings. You can not edit titles or descriptions at this page so if you need to change such data you have to contact Resurs Bank support.
sv_se: Det här avsnittet innehåller information om dina aktuella betalningsmetoder som är kopplade till dina API-inställningar. Du kan inte redigera titlar eller beskrivningar på denna sida så om du behöver ändra sådana uppgifter måste du kontakta Resurs Bank support.

source: Order id numbering
sv_se: Orderid-numrering

source: Decide which kind of order id/reference that should be used when customers are placing orders. If you let the plugin set the reference, the reference will be based on a timestamp with an ending random number to make them unique (i.e. YYYYMMDDHHMMSS-UNIQUE).
sv_se: Välj vilken typ av orderid/referens som skall användas när kunder placerar ordrar. Om du låter tillägget sätta referensen kommer den att basera på en tidsstämpel med en avslutande slumpmässigt valt nummer för att göra dem unika (exempelvis YYYYMMDDHHMMSS-UNIKTID).

source: Let plugin set the reference
sv_se: Låt tillägget sätta referensen

source: Use WooCommerce internal post id as reference
sv_se: Använd WooCommerce interna postid som referens

source: Checkout method logotypes
sv_se: Logotyper för betalningsmetoder

source: Prefer to not display logotypes
sv_se: Föredra att inte visa logotyper

source: Display logotypes as WooCommerce default
sv_se: Visa logotyper så som WooCommerce visar dem

source: Display icons only if they are of customized
sv_se: Visa ikoner endast om de är anpassade

source: Display Resurs branded and customized icons
sv_se: Visa Resurs-märkta och anpassade ikoner

source: If there are branded payment methods in your checkout, that you prefer to display, choose your best option here. Observe that this option is entirely dependent on your theme and no layout are rendered through this as we use the default icon setup in WooCommerce to show the icons.
sv_se: Om det finns "brandade" betalningsmetoder i din kassa, som du föredrar att visa, välj ditt lämpligaste alternativ här. Observera att det här alternativet är helt beroende av ditt tema och ingen layout rendereras genom detta eftersom vi använder standardikoninställningarna i WooCommerce för att visa dem.

source: Applicant fields are always visible
sv_se: Fält för sökande kund är alltid synliga

source: The applicant fields that Resurs Bank is using to handle payments is normally, inherited from WooCommerce standard billing fields in the checkout. You can however enable them here, if you want your customers to see them anyway.
sv_se: De fält för sökande som Resurs Bank använder för att hantera köp ärvs normalt sett från WooCommerce standardfält för fakturaadressen. Du kan dock aktivera här, om du ändå vill att dina kunder skall se dem.

source: Use address information lookup service
sv_se: Använd uppslagstjänst för adressinformation

source: This enables address lookup forms (getAddress) in checkout, when available. Countries currently supported is SE (government id) and NO (phone number).
sv_se: Detta aktiverar adressuppslagsformulär (getAddress) i kassan när det är tillgängligt. Länder som för närvarande stöds är SE (personnummer) och NO (telefonnummer).

source: Always show government id field from address service
sv_se: Visa alltid personnummerfältet från adresstjänsten

source: With this setting enabled, the getAddress form will always be shown, regardless of country compatibility.
sv_se: När den här inställningen är aktiverad visas alltid formuläret getAddress, oavsett landskompatibilitet.

source: How to display payment method titles
sv_se: Hur titlar för betalmetoder visas

source: Default title.
sv_se: Standardtiteln.

source: Use the ID of the chosen payment method.
sv_se: Använd ID:t för den valda betalningsmetoden.

source: Use the description of the chosen payment method.
sv_se: Använd beskrivningen av den valda betalningsmetoden.

source: When payment methods are mentioned in order data and Resurs Checkout payments, you can choose how it should be displayed. Selecting anything but the default value will display the ID or description of a chosen payment method instead of "Resurs Bank AB".
sv_se: När betalningsmetoder nämns i orderdata och Resurs Checkout-betalningar kan du välja hur de ska visas. Om du väljer allt annat än standardvärdet visas ID:t eller beskrivningen av en vald betalningsmetod i stället för "Resurs Bank AB".

source: Defines where in the checkout the iframe should be placed. Preferred position is after the checkout form and also default. This setting is also configurable with filters.
sv_se: Definierar var i kassan iframe ska placeras. Önskad position är efter kassaformuläret och även standard. Den här inställningen kan också konfigureras med filter.

source: After checkout form (Default).
sv_se: Efter kassaformulär (Standard).

source: Before order review.
sv_se: Före orderns sammanställning.

source: Part payment template
sv_se: Mall för delbetalning

source: When you enable the part payment options for products, you can choose your own template to display. Templates are built on WordPress pages. If you want to show a custom page, you may choose which page you want to show here. Shortcodes that can be use: [currency], [monthlyPrice], [monthlyDuration], [methodId], [methodDescription]. If you use a custom text [monthlyPrice] will be delivered without the currency, so you have to add that part yourself.
sv_se: När du aktiverar delbetalningsalternativen för produkter kan du välja vilken mall du vill visa. Mallar är byggda på WordPress-sidor. Om du vill visa en anpassad sida kan du välja vilken sida du vill visa här. Kortkoder som kan användas: [currency], [monthlyPrice], [monthlyDuration], [methodId], [methodDescription]. Om du använder en anpassad text [monthlyPrice], levereras priset utan valuta, så du måste lägga till den delen själv.

source: Allow part payment information in checkout
sv_se: Tillåt delbetalningsinformation i kassan

source: If part payment information is enabled with annuity factors, you can choose to activate this template in the cart review and the order review.
sv_se: Om delbetalningsinformation är aktiverad med annuitetsfaktorer, kan du välja att aktivera den här mallen i kundvagnsgranskningen och ordergranskningen.

source: Use default (Completed)
sv_se: Använd standard (Färdigbehandlad)

source: Processing
sv_se: Behandlas

source: Credited (refunded)
sv_se: Krediterad (Återbetald)

source: Completed
sv_se: Färdigbehandlad

source: Pending (on-hold)
sv_se: Pausad (on-old)

source: Annulled (cancelled)
sv_se: Avbruten (cancelled)

source: Accept rejected callbacks
sv_se: Acceptera avvisade motringningar

source: When Resurs Bank has a callback delivery where the order does not exist in the system, the plugin will respond with another HTTP code. If callbacks from Resurs Bank is repeatedly sending too many messages of this kind due to any kind of errors (like loops, etc), this option allows the plugin to reply with a response that says that the callback was successful anyway.
sv_se: När Resurs Bank levererar en callback där ordern inte finns i systemet svarar tilläggs-programmet med en annan HTTP-kod. Om callbacks från Resurs Bank upprepade gånger skickar för många meddelanden av detta slag på grund av någon av form av fel (som exempelvis loopar), så tillåter det här alternativet tillägget att svara med ett svar som säger att återuppringningen lyckades ändå.

source: Update payment methods and annuity factors
sv_se: Uppdatera betalningsmetoder och delbetalningsfaktorer

source: Update callbacks
sv_se: Uppdatera callbacks

source: Request test from Resurs Bank
sv_se: Begär test från Resurs Bank

source: Fraud control
sv_se: Bedrägerikontroll

source: How to handle fraud and debiting
sv_se: Hantering av bedrägeri och debitering

source: This section configures how fraud and finalizations should be handled in the integrated (simplified flow) and hosted checkout (not Resurs Checkout!). It is strongly recommended to keep the settings disabled and let callbacks handle the rest, unless you are a travel company that rely on non fraudulent behaviours. The settings below makes sure that orders that is frozen when the order has been handled are automatically annulled. If the orders in other hands are healthy and booked you can also set the process to automatically debit/finalize the order with the setup below. For more information, see <a href="%s" target="_blank">%s</a>.
sv_se: Den här sektionen ställer in hur bedrägerier och debitering (finalisering) skall hanteras i den integrerade (simpla flödet) och hostade kassalösningen (inte Resurs Checkout!). Det är starkt rekommenderat att behålla inställningarna avstängda och låta callbacks sköta resten, såvida du inte äger ett reseföretag och lägger din tillit helt till att bedrägerier inte får förekomma. Inställningarna nedan säkerställer att ordrar som är frusna när ordern är genomförd hanteras och annulleras automatiskt. Om ordern å andra sidan är frisk och bokad, kan du också ställa in så att ordern debiteras/finaliseras automatiskt. För mer information, se <a href="%s" target="_blank">%s</a>.

source: Wait for fraud control
sv_se: Vänta på bedrägerikontroll

source: The checkout process waits until the fraud control is finished at Resurs Bank and the order is handled synchronously. If this setting is disabled, Resurs Bank must be able to reach your system with callbacks to be able to deliver the result.
sv_se: Kassaprocessen väntar tills bedrägerikontrollen är klar hos Resurs Bank och beställningen hanteras synkront. Om den här inställningen är inaktiverad måste Resurs Bank kunna nå ditt system med callbacks för att kunna leverera resultatet.

source: Annul frozen orders
sv_se: Annullera frusna ordrar

source: If Resurs Bank freezes a payment due to fraud, the order will automatically be annulled. By default, the best practice is to handle all annulments asynchronously with callbacks. Callback event name is ANNUL.
sv_se: Om Resurs Bank fryser en order på grund av bedrägeri, så kommer ordern automatiskt att annulleras. Som standard, är det rekommenderat att hantera alla annulleringar asynkront med callbacks. Callbackens namn är ANNUL.

source: Automatically debit if booked
sv_se: Debitera automatiskt vid bokning

source: Orders are automatically debited (finalized) if the fraud control passes. By default, the best practice is to handle all finalizations asynchronously with callbacks. Callback event name is FINALIZATION.
sv_se: Ordrar blir automatiskt debiterade (finaliserade) om bedrägerikontrollen passeras. Som standard är det rekommenderat att hantera alla debiteringar asynkront med callbacks. Callbackens namn är FINALIZATION.

source: Resurs Checkout customer interaction behaviour
sv_se: Resurs Checkout beteenden vid kundinteraktion

source: Advanced Merchant
sv_se: Avancerad handlare

source: Advanced API
sv_se: Avancerat API
