Repository: Tornevall/tornevalls-resurs-bank-payment-gateway-for-woocommerce
Catalog: language/tornevalls-resurs-bank-payment-gateway-for-woocommerce-*.po
Languages: sv_se

source: Queued Status Handler: Status for %s not updated to %s, because that status was already set.
sv_se: Uppköad statushantering: Status för %s uppdaterades inte %s, eftersom den statusen redan har angetts.

source: Payment Methods are currently unavailable!
sv_se: Betalningsmetoder är för närvarande inte tillgängliga!

source: Default (Choice made by plugin)
sv_se: Standard (Val gjort av plugin)

source: Mocked Exception in action. Throwing MockException for function %s, with error code %d.
sv_se: Fiktivt undantagsfel körs. Kastar MockException för funktion %s, med felkod %d.

source: The filter "%s" is currently put in an active state by an unknown third party plugin. This setting is deprecated and no longer fully supported. It is highly recommended to disable or remove the filter entirely and solve the problem that required this from start somehow else.
sv_se: Filtret "%s" är för närvarande satt i ett aktivt tillstånd av ett okänt plugin från tredje part. Den här inställningen är inaktuell och stöds inte längre fullt ut. Det rekommenderas starkt att inaktivera eller ta bort filtret helt och lösa problemet som krävde detta från början på något annat sätt.

source: Merchant API token renewed.
sv_se: Merchant API-token förnyad.

source: Merchant API token reused.
sv_se: Merchant API-token återanvänds.

source: Ecom request %s for %s with different credentials (%s, in environment %s).
sv_se: ECom förfrågan %s för %s med olika användaruppgifter (%s, med miljö %s).

source: Got exception %d in %s, will retry with REST.
sv_se: Fel %d uppstod i %s, kommer försöka igen med REST.

source: Resurs Bank billing address mismatch with current address in order. Data has synchronized with Resurs Bank billing data.
sv_se: Resurs Banks faktureringsadress matchar inte den aktuella adressen i ordern. Data har synkroniserats med Resurs Banks fakturadata.

source: The country (%s) this customer is using are not matching the one currently set in WooCommerce (%s). It is not guaranteed that all payment methods is shown in this mode.
sv_se: Landet (%s) som den här kunden använder matchar inte det som för närvarande anges i WooCommerce (%s). Det är inte garanterat att alla betalningsmetoder visas i det här läget.

source: Settings
sv_se: Inställningar

source: Order has not been created by this plugin and the original plugin is currently unavailable.
sv_se: Den här ordern har inte skapats med denna tilläggsmodul och den tidigare modulen är för närvarande inte tillgänglig.

source: EComPHP data present. Saving metadata for order %s.
sv_se: Det finns data från EComPHP. Sparar metadata för order %s.

source: This payment is marked with reference problems. This means that there might have been problems when the payment was executed and tried to update the payment reference (%s) to a new id (%s). You can check the UpdatePaymentReference values for errors.
sv_se: Den här betalningen är markerad med referensproblem. Detta innebär att det kan ha varit problem när betalningen utfördes och försökte uppdatera betalningsreferensen (%s) till ett nytt ID (%s). Du kan kontrollera värdena under UpdatePaymentReference för fel.

source: [missing reference]
sv_se: [saknad referens]

source: Session value %s set to %s.
sv_se: Sessionsvärdet %s är inställt på %s.

source: Callback received for order "%s" but something went wrong: %s
sv_se: Återuppringning togs emot för order "%s" men något gick fel: %s

source: Callback (%s) Handling for %s finished.
sv_se: Callback (%s) Hantering för %s klar.

source: Callback received from Resurs Bank: %s (Digest Status: %s, External ID: %s, Internal ID: %d).
sv_se: Callback mottagen från Resurs Bank: %s (Digest Status: %s, Externt ID: %s, Internt ID: %d).

source: Valid
sv_se: Giltig

source: Invalid
sv_se: Ogiltig

source: setOrderNote for %s: %s
sv_se: setOrderNote för %s: %s

source: Callback with parameter %s received, but failed because $order could not instantiate and remained null.
sv_se: Callback med parametern %s mottagen, men misslyckades eftersom $order inte kunde instansieras och förblev null.

source: Resurs Bank order status update indicates direct debited payment method.
sv_se: Resurs Banks orderstatusuppdatering indikerar direktdebiterande betalningsmetod.

source: Order status update to %s has been queued.
sv_se: Orderstatusuppdatering till %s har köats.

source: Resurs Bank queued order update: Change from %s to %s from queue.
sv_se: Resurs Bank köade orderuppdatering: Ändring från %s till %s från kön.

source: Exception (%s) from %s: %s.
sv_se: Undantag (%s) från %s: %s.

source: Payment fee
sv_se: Betalningsavgift

source: The current plugin "%s" requires at least version %s - for the moment, you are running on version %s. You should consider upgrading as soon as possible.
sv_se: Det nuvarande tillägget "%s" kräver som minst version %s - för tillfället använder du version %s. Du bör överväga att uppgradera så snart som möjligt.

source: It seems that you still have another plugin enabled (%s %s) in this platform that works as Resurs Bank Payment Gateway. If this is intended, you can ignore this message.
sv_se: Det verkar som om du fortfarande har ett annat plugin aktiverat (%s %s) i denna plattform som fungerar som Resurs Bank Payment Gateway. Om detta är avsiktligt så kan du ignorera det här meddelandet.

source: Apply filter: %s
sv_se: Tillämpa filter: %s

source: Resurs Checkout (RCO) is a one page stand-alone checkout, embedded as an iframe on the checkout page. It is intended to give you a full scale payment solution with all payment methods collected at the endpoint of Resurs Bank.
sv_se: Resurs Checkout (RCO) är en fristående ensides-kassa, inbäddad som en iframe på kassasidan. Syftet är att ge dig en fullskalig betallösning med alla betalningsmetoder ihopsamlade hos Resurs Bank.

source: The integrated checkout (also known as the "simplified shop flow") is a direct integration with WooCommerce which uses intended APIs to interact with your customers while finishing the orders.
sv_se: Den integrerade kassalösning (även känd som "simplified shop flow" - ett förenklat butiksflöde) är en direkt integration med WooCommerce, vilken använder avsedda API:er för att interagera med dina kunder, medan de avslutar ett köp.

source: "Resurs Hosted Checkout" works similarly as the integrated simplified checkout, but on the checkout itself the customer are redirected to a hosted website to fulfill their payments. It can be quite easily compared with a Paypal solution.
sv_se: "Resurs Hosted Checkout" fungerar på samma sätt som den integrerade förenklade kassan, men i kassan omdirigeras kunden till en sida på Resurs Bank där köpet avslutas. Lösningen kan relativt enkelt jämföras med en Paypal-lösning.

source: Validate and save credentials
sv_se: Verifiera och spara autentiseringsuppgifter

source: The credential check failed. If you save the current data we can not guarantee that your store will properly work.
sv_se: Autentiseringskontrollen misslyckades. Om du sparar aktuella data kan vi inte garantera att din butik kommer att fungera korrekt.

source: The credential check was successful. You may now save the rest of your data.
sv_se: Autentiseringskontrollen lyckades. Du kan nu spara resten av uppgifterna.

source: This setting requires you to enable the fraud control.
sv_se: Den här inställningen kräver att bedrägerikontrollen är aktiverad.

source: Waiting for test callback to arrive.
sv_se: Väntar på att testanrop ska komma fram.

source: Callback trigger is currently not working.
sv_se: Motanropsutlösare fungerar för närvarande inte.

source: Callback trigger timeout. Aborted.
sv_se: Timeout för callback-utlösare. Avbröts.

source: Are you sure you want to remove callback
sv_se: Vill du ta bort callback

source: Callback URLs for Resurs Bank may be outdated. Do you want to refresh the current data?
sv_se: Callbackadresser för Resurs Bank kan vara inaktuella. Vill du uppdatera nuvarande data?

source: Refresh has finished. Please check your new settings to confirm the update.
sv_se: Uppdateringen är klar. Kontrollera dina nya inställningar för att bekräfta uppdateringen.

source: Disable
sv_se: Inaktivera

source: By accepting this, all your settings for this plugin will be restored to the absolute defaults. The only thing that will be kept intact is encryption keys, so that you do not loose access to prior order data if they exist encrypted. Are you sure?
sv_se: Genom att acceptera detta kommer alla dina inställningar för detta plugin att återställas till absoluta standardinställningar. Det enda som kommer att behållas intakt är krypteringsnycklar, så att du inte förlorar åtkomst till tidigare orderdata om de finns krypterade. Är du säker på detta?

source: Settings has been restored to default values. You may now reconfigure this plugin.
sv_se: Inställningarna har återställts till standardvärden. Du kan nu omkonfigurera detta plugin.

source: Plugin configuration reset failed. You may want to reload the page and try again.
sv_se: Återställning av plugin-konfigurationen misslyckades. Du kanske vill ladda om sidan och försöka igen.

source: Plugin configuration reset has been cancelled.
sv_se: Återställning av tilläggskonfigurationen avbröts.

source: Successful.
sv_se: Lyckades.

source: Failed.
sv_se: Misslyckades.

source: Please wait while reloading...
sv_se: Vänligen vänta medan omladdning sker...

source: The page security (nonce) is reportedly expired or wrong. This can also be caused by the fact that you have already interacted with the page you are trying to update information on. You may want to reload your browser before proceeding.
sv_se: Sidsäkerheten (nonce) har enligt uppgift upphört att gälla eller är felaktig. Detta kan också orsakas av att du redan har interagerat med sidan du försöker uppdatera information på. Du kanske vill ladda om webbläsaren innan du fortsätter.

source: Import credentials from Resurs v2.x
sv_se: Importera loginuppgifter från Resurs v2.x

source: Import successful.
sv_se: Importen lyckades.

source: Import failed.
sv_se: Importen misslyckades.

source: Billing Address
sv_se: Faktureringsadress

source: Available callbacks
sv_se: Tillgängliga callbacks

source: Callback URL
sv_se: Callback-länk

source: Remove
sv_se: Ta bort

source: Order information and metadata for Resurs Bank
sv_se: Order-information och metadata från Resurs Bank

source: Payment could not be found at Resurs Bank. The metadata in the plugin however has been marked as a payment failure at least once during the initial process of the purchase. The customer in question may have been declined and then did not proceed. The purchase could also have failed by other reasons, like internal server errors at Resurs Bank.
sv_se: Betalning kunde inte hittas hos Resurs Bank. Metadata i pluginet har dock markerats med ett betalningsfel som uppstått minst en gång under den första processen för köpet. Kunden i fråga kan ha nekats och sedan inte gått vidare. Köpet kan också ha misslyckats av andra orsaker, såsom interna serverfel på Resurs Bank.

source: Not created with this plugin!
sv_se: Inte skapad med detta tilläggsplugin!

source: Purchased with merchant username "%s" from environment "%s".
sv_se: Betalad med användarnamn "%s" från miljö "%s".

source: Expand metadata view
sv_se: Expandera vyn över metadata

source: Data will only be displayed if the purchase has been made with another merchant account than the current in use.
sv_se: Data visas bara om köpet har gjorts med ett annat webservicekonto än det aktuella som används.

source: This data is shown to you since the purchase has been made with another merchant account than the current in use.
sv_se: Dessa data visas för dig eftersom köpet har gjorts med ett annat webservicekonto än det aktuella som används.

source: Yes.
sv_se: Ja.

source: No.
sv_se: Nej.

source: Number of decimals - Beware!
sv_se: Antal decimaler - Observera!

source: The plugin "%s" does not support rounding with lower than two decimals due to tax calculation problems. When a purchase is made you will notice that the rounding with two decimals will still be visible for all payment methods that has been registered with this plugin. If you really want to change this, you are required to actively disable the rounding prevention protection in the advanced section. By doing this you also confirm that you are willingly using an unsupported feature. To remove this notification you can also raise the decimals to 2 or higher.
sv_se: Pluginet "%s" stödjer inte avrundningar med lägre än två decimaler, på grund av momsberäkningsproblem. När en betalning utförs kommer du lägga märke till att avrundningen med två decimaler fortfarande kommer synas för alla betalningsmetoder som har registrerats med detta pluginet. Om du verkligen vill ändra detta så är du aktivt tvingad att stänga av avrundningsskyddet i den avancerade sektionen. Genom att göra detta bekräftar du också att du frivilligt använder en funktion som inte stöds. För att inaktivera denna notifikationen kan du även öka antalet decimaler till 2 eller högre.

source: Amount limits: Defines from-to which order amount a payment method will be displayed in the checkout.
sv_se: Beloppsgränser: Definierar från-till vilket orderbelopp en betalningsmetod blir synlig.

source: Customer types: Which customers that can take advantage of a specific payment method (NATURAL: Private customers, LEGAL: Company based customers).
sv_se: Kundtyper: Vilka kunder som kan dra nytta av en specifik betalningsmetod (NATURAL: Privatkunder, LEGAL: Företagsbaserade kunder).

source: Method ID
sv_se: Metod-ID

source: Name/Title
sv_se: Namn/Titel

source: Description (No HTML)
sv_se: Beskrivning (Ingen HTML)

source: Payment Fee
sv_se: Betalningsavgift

source: Amount Limits
sv_se: Beloppsgränser

source: Method type
sv_se: Typ av metod

source: Customer types
sv_se: Kundtyper

source: Part payment options
sv_se: Alternativ för delbetalning

source: Amount limits (min - max).
sv_se: Beloppsgränser (min - max).

source: Received error from annuity factors request: %s (%d)
sv_se: Tog emot fel från förfrågan om delbetalningsfaktorer: %s (%d)

source: To be able to use fee settings, you have to change the plugin to work with the simplified or hosted shopflow.
sv_se: För att kunna använda avgiftsinställningar, måste du ändra till det förenklade eller hostade butiksflödet.

source: Fee settings: Allowed.
sv_se: Avgiftsinställningar: Tillåtet.

source: Shipping Address
sv_se: Leveransadress

source: Contacting Support
sv_se: Kontakta Support

source: Subscribe to newsletters.
sv_se: Prenumerera på nyhetsbrev.

source: About this plugin
sv_se: Om detta tillägg

source: Tornevalls Resurs Bank payment gateway for WooCommerce
sv_se: Tornevalls Resurs Bank betalningslösning för WooCommerce

source: Connect Resurs Bank as WooCommerce payment gateway.
sv_se: Anslut Resurs Bank som WooCommerce betalningsgateway.
