Repository: Tornevall/tornevalls-resurs-bank-payment-gateway-for-woocommerce
Catalog: language/tornevalls-resurs-bank-payment-gateway-for-woocommerce-*.po
Languages: sv_se

source: Resurs Checkout paymentId maximum age.
sv_se: Resurs Checkout paymentId maximal ålder.

source: Defined in seconds, how long a preferred payment id can live before it is renewed in a current session. This setting is necessary as we use the id to track cart updates which very much prevents malicious cart manipulation. It also allows customers to reload the checkout page and still use the same payment id. When a payment is successful, the preferred payment id will also be reset.
sv_se: Definieras i antal sekunder, hur länge ett föredraget betalningsid kan leva innan det förnyas i en aktuell session. Den här inställningen är nödvändig eftersom vi använder id för att spåra kundvagnsuppdateringar som i hög grad förhindrar skadlig varukorg-manipulation. Det gör det också möjligt för kunder att ladda om kassasidan och fortfarande använda samma betalningsid. När en betalning lyckas, återställs även det önskade betalningsid:t.

source: Queue order statuses on successpage
sv_se: Köa upp orderstatusar på sidan för lyckat köp

source: If you suspect that there may be race conditions between order status updates in the customer-success landing page, and the order statuses updated with callbacks you can enable this option to queue not only the callback updates but also the other updates.
sv_se: Om du misstänker att det kan finnas konkurrens mellan orderstatusuppdateringar på landningssidan för lyckade orders och orderstatusar som uppdateras med callbacks kan du aktivera det här alternativet för att köa, inte bara motringningsuppdateringarna, utan även de andra uppdateringarna.

source: Do not add VAT to discounts
sv_se: Lägg inte till moms i rabatter

source: When order rows are added to Resurs Bank API, the VAT is applied on the coupon amount excluding tax. To handle the discount without vat and instead use the full including tax amount as a discount, you can enable this feature.
sv_se: När orderrader läggs till Resurs Bank API, tillämpas momsen på kupongbeloppet exklusive moms. För att hantera rabatten utan moms och istället använda hela inklusive moms-beloppet som rabatt kan du aktivera den här funktionen.

source: Prevent rounding errors
sv_se: Förebygg avrundningsproblem

source: WooCommerce are able to show prices rounded with 0 decimals. It is however widely known and confirmed that payment gateways may have problems with tax calculation, when the decimals are fewer than two. With this setting enabled, the plugin will try to override the decimal setup as long as it is set to lower than 2. If you use this feature, you also confirm that you are willingly using a, for the platform, unsupported feature. If you've not already done it, it is recommended to instead increase the number of decimals to 2 or higher.
sv_se: WooCommerce kan visa priser avrundade med 0 decimaler. Det är dock allmänt känt och bekräftat att betalningsportar kan ha problem med momsberäkning, när decimalerna är färre än två. Med den här inställningen aktiverad kommer plugin-programmet att försöka åsidosätta decimalinställningen så länge den är inställd på lägre än 2. Om du använder den här funktionen bekräftar du också att du frivilligt använder en funktion som inte har ordentligt stöd i plattformen. Om du inte redan har gjort det rekommenderar vi att du i stället ökar antalet decimaler till 2 eller högre.

source: Can interact with old-plugin orders
sv_se: Kan interagera med beställningar som hanterats med ett det gamla pluginet

source: Enabling this feature allows the plugin to enter orders created with the old plugin.
sv_se: Genom att aktivera den här funktionen får pluginet tillträde till beställningar som skapats med den äldre versionen.

source: Store API history in orders
sv_se: Lagra API-historik i ordrar

source: If this setting is active, the first time you view a specific order API data will be stored for it. This means that it will be possible to go back to prior orders and view them even after you change the user credentials.
sv_se: Om denna inställningen är aktiverad så kommer uppgifter för APIet lagras i respektive order första gången du granskar den. Detta innebär att det blir möjligt att gå tillbaka tilltidigare ordrar och titta på dem även efter att du byter användaruppgifter.

source: WSDL requests are cached
sv_se: WSDL-förfrågningar cachas

source: Default: Only for production/live environment
sv_se: Standard: Enbart i produktion/live

source: Both for production/live and test/staging
sv_se: Både i produktion/live och test/staging

source: Do not cache WSDL
sv_se: Cachelagra inte WSDL

source: This setting defines how SOAP requests are being made to Resurs Bank. It is usually recommended to keep requests cached (meaning wsdl and data required for a SOAP call to work, are stored locally on your server). During development it sometimes better to run tests uncached, however, it is not recommended in a production since this directly affects network performance (since each SOAP call will include an extra network request to the API first).
sv_se: Den här inställningen definierar hur SOAP-anrop görs till Resurs Bank. Vi rekommenderar vanligtvis att du håller anropen cachelagrade (vilket innebär att wsdl och data som krävs för att ett SOAP-anrop skall fungera lagras detta lokalt på servern). Under utveckling är det ibland bättre att köra tester ocachat, men det rekommenderas inte i en produktion eftersom detta direkt påverkar nätverksprestanda (eftersom varje SOAP-anrop kommer att utföra en extra nätverksbegäran mot API'et först).

source: Developer Section
sv_se: Utvecklar-inställningar

source: Logging
sv_se: Loggning

source: Default for this plugin is to log a fair amount of data for you. However, there is also also much debug data for developers available, that you normally not need. In this section you can choose the extras you want to see in your logs.
sv_se: Standard för detta plugin är att logga lagom åt dig. Men det finns också mycket felsökningsdata för utvecklare tillgängliga, som du normalt sett inte behöver ta del av. I det här avsnittet kan du välja de extrafunktioner du vill kunna se i dina loggar.

source: Put payment methods and callbacks list on first tab
sv_se: Sätt betalningsmetoder och listan med callbacks under första fliken

source: In the former plugin designed by Resurs Bank, payment methods and callbacks was listed on the first configuration tab. Some maybe prefer this before the centralization and the minimalistic view on the front configuration. Enable this flag, to move around the configuration.
sv_se: I den tidigare plugin-versionen som utformats av Resurs Bank, listades betalningsmetoder och callbacks under den första konfigurationsfliken. Vissa föredrar kanske detta före centraliseringen och den minimalistiska vyn på frontkonfigurationen. Aktivera denna inställning, för att flytta runt konfigurationen.

source: Protect personal data in logs
sv_se: Skydda personliga data i loggfiler

source: To protect customers, customer data will be obfuscated in logs during debugging. If you really must change this to see debugged customers, this setting is the one to disable. However, as this is an alternative to be GDPR compliant in debug logs you should probably consider avoiding this.
sv_se: För att skydda kunder kommer kunddata att förvrängas i loggar vid felsökning. Om du verkligen måste ändra detta för att kunna felsöka kunder, är det denna inställningen du inaktiverar. Eftersom detta är ett alternativ för att försöka tillmötesgå GDPR i felsökningsloggar bör du förmodligen överväga att undvika detta.

source: Log merchant details (CAN_LOG_ORDER_EVENTS)
sv_se: Logga information för handlare (CAN_LOG_ORDER_EVENTS)

source: Detailed order events are data that normally passes without any sound. Things like initial order creations and clicks could show up in your logs.
sv_se: Detaljerade orderhändelser är data som normalt passerar utan ljud. Saker som inledande orderskapande och klick kan visas i dina loggar.

source: Log informative (CAN_LOG_INFO)
sv_se: Logga information (CAN_LOG_INFO)

source: Log events that flows under severity INFO. Logs affected is for example mocking events.
sv_se: Logga händelser som ligger under allvarlighetsgrad INFO. Loggar som påverkas är till exempel mockade händelser.

source: Log developer order events (CAN_LOG_ORDER_DEVELOPER)
sv_se: Logga orderhändelser för utvecklare (CAN_LOG_ORDER_DEVELOPER)

source: Works like details for merchants, but this adds debugging information that may only be relevant for developers.
sv_se: Fungerar som detaljer för handlare, men detta lägger till felsökningsinformation som kanske bara är relevant för utvecklare.

source: Deep details (CAN_LOG_JUNK)
sv_se: Djupgående detaljer (CAN_LOG_JUNK)

source: Things that only developers would have interest in. Logs may be noisy with this option enabled.
sv_se: Saker som bara utvecklare skulle ha intresse av. Loggar kan bli skräpiga med det här alternativet aktiverat.

source: Log backend requests (CAN_LOG_BACKEND)
sv_se: Logga backend-förfrågningar (CAN_LOG_BACKEND)

source: Log backend events triggered by the the javascript method that handles all AJAX requests (ajaxify-js).
sv_se: Logga backend-förfrågningar som utlösts av javascript-metoden som hanterar alla AJAX-anrop (ajaxify-js).

source: Special Tweaks Section
sv_se: Sektion för special-tweaks

source: If you have no idea what this is for, do not touch it.
sv_se: Om du inte vet vad det här, rör det inte.

source: Activate Advanced Tweaking Mode (Developer)
sv_se: Aktivera avancerat justeringsläge (utvecklare)

source: Activate Advanced Tweaking Mode (you might need an extra reload after save)
sv_se: Aktivera avancerat justeringsläge (du kan behöva en extra omladdning efter att du sparat)

source: The developer section is normally nothing you will need, unless you are a very advanced administrator/developer/merchant that likes to configure a little bit over the limits. If you know what you are doing, feel free to activate this section.
sv_se: Utvecklarsektionen är normalt sett inte något du kommer behöva, förutsatt att du inte är en väldigt avancerad administratör/utvecklare/handlare som gillar att konfigurera lite över gränserna. Om du vet vad du gör, kan du aktivera sektionen.

source: Reset all settings
sv_se: Nollställ alla inställningar

source: Resets the entire database settings storage of the plugin to its absolute defaults, except encryption keys.
sv_se: Nollställer hela databasens lagrade inställningar för tillägget till sina absoluta defaults, förutom krypteringsnycklar.

source: Support
sv_se: Support och hjälp

source: JWT Client ID
sv_se: JWT-klient-ID

source: JWT Client ID.
sv_se: JWT-klient-ID.

source: JWT Client Password
sv_se: Lösenord för JWT-klient

source: JWT Client Password.
sv_se: Lösenord för JWT-klient.

source: JWT Store ID
sv_se: JWT-butiks-ID

source: Numeric store id or uuid-based.
sv_se: Numeriskt butiks-id eller uuid-baserat.

source: Developers Section
sv_se: Utvecklar-inställningar

source: This section is for very advanced tweaking only. It is not enabled and visible by default for security reasons. Proceed at your own risk!
sv_se: Det här avsnittet är endast för mycket avancerad justering. Den är inte aktiverad och synlig som standard av säkerhetsskäl. Fortsätt på egen risk!

source: Developer Settings
sv_se: Utvecklar-inställningar

source: Trust is_admin before frontend nonces.
sv_se: Lita alltid på is_admin före frontend-nonces.

source: Yes, do trust them please.
sv_se: Ja, lita på dem, tack.

source: For some places in the admin panel, we use nonces as an extra security layer when it comes to requests like updating callbacks, payment methods, etc. Sometimes nonces expires too quickly and breaks requests in wp_admin. Enable this feature to start trusting is_admin() during ajax request primarily and nonces secondarily. is_admin is normally a security layer that prevents unknonwn requests to be executed.
sv_se: För vissa platser i administratörspanelen använder vi nonces som ett extra säkerhetslager när det gäller förfrågningar som att uppdatera callbacks, betalningsmetoder etc. Ibland upphör avvikelser att gälla för snabbt och förstör anropen i wp_admin. Aktivera den här funktionen för att börja lita is_admin() under Ajax begäran i första hand och nonces i andra hand. is_admin är normalt sett ett säkerhetslager som förebygger exekvering från okända anrop.

source: Activate "real people"-mode in test, for getAddress.
sv_se: Aktivera "riktiga människor"-läge i test, för getAddress.

source: Enable.
sv_se: Aktivera.

source: Required production credentials available: When activating this mode, getAddress will use real lookups for getAddress rather than the mocked data.
sv_se: Autentiseringsuppgifter för produktion krävs: När du aktiverar det här läget kommer getAddress att använda riktiga uppslag för getAddress snarare än påhittad data.

source: Allow mocked behaviours
sv_se: Tillåt simulerade beteenden

source: This setting enables mocked behaviours and data on fly, during tests.
sv_se: Den här inställningen möjliggör påhittade beteenden och data "on fly" under tester.

source: Prefix for order and status notes
sv_se: Prefix för order- och statusanteckningar

source: When orders are updated with new statuses, or gets new notifications this is how we are prefixing the notes. Default (empty) is "trbwc".
sv_se: När en order uppdateras med nya statusar, eller får nya meddelanden, är det så vi prefixar anteckningarna. Standard (tom) är "trbwc".

source: Use another URL for the SOAP-API. Currently only for test environment!
sv_se: Använd en annan URL för SOAP-APIet. För närvarande endast för testmiljö!

source: Bleeding Edge Checkout Technology
sv_se: Bleeding Edge Checkout-teknik

source: Enable
sv_se: Aktivera

source: Enable features that is still under development. The features enabled here are not guaranteed to work in production environments and should only be enabled by a developer.Bleeding edge mode can currently only be used in test. Also please note, that featureswithin this area, requires higher versions of PHP.
sv_se: Aktivera funktioner som fortfarande är under utveckling. De funktioner som aktiveras här är inte garanterade att fungera i produktionsmiljöer och bör endast aktiveras av en utvecklare. Bleeding edge-läge kan för närvarande endast användas i test. Observera också att funktioner inom detta område kräver högre versioner av PHP.

source: Mocking & Testing
sv_se: Simuleringsektion

source: Mocking Section
sv_se: Simuleringsektion

source: Section of Mocking & Tests. Are you not developing this plugin? Then you probably do not need it either. The section is specifically placed hiddenly here, since the options here are used to recreate events under very specific circumstances. For example, you can mock errors from here, that you otherwise had to hardcode into the plugin. Options here are normally enabled until the feature has been trigged once. After first execution it will instantly become disabled automatically. The mocking section can only be enabled when your environment is set to test and you explicitly allowed mocking on your site.
sv_se: Avsnitt för Mocking & Tests. Utvecklar du inte det här pluginet? Då behöver du den förmodligen inte heller. Avsnittet placeras specifikt dolt här, eftersom alternativen här används för att återskapa händelser under mycket specifika omständigheter. Till exempel kan du testa felhantering härifrån, som du annars skulle vara tvungen att hårdkoda in i pluginet. Alternativen här är normalt aktiverade tills funktionen har körts en gång. Efter den första körningen blir den omedelbart inaktiverad automatiskt. Mockningssektionen kan bara aktiveras när din miljö är inställd på att testa och du uttryckligen tillåter mockning- och testning på din webbplats.

source: Fail on updatePaymentReference
sv_se: Misslyckas vid uppdateringBetalningReference

source: This setting enables a fictive error on front-to-back calls during order creations where updatePaymentReference occurs.
sv_se: Den här inställningen aktiverar ett fiktigt fel vid fontend-backend-event, under orderskapanden där updatePaymentReference inträffar.

source: Fail on iframe creation
sv_se: Misslyckas med att skapa iframe

source: This setting enables a fictive error in the checkout where the iframe fails to render. This has happened during development, where the current payment id used by the plugin collided with an already existing order id at Resurs Bank.
sv_se: Den här inställningen aktiverar ett fiktivt fel i kassan där iframe inte kan skapas. Detta har skett under utveckling, där det nuvarande betalnings id som användes av tillägget kolliderade med ett redan befintligt order-id på Resurs Bank.

source: Fail on callback update in wp-admin
sv_se: Misslyckas med att uppdatera callbacks i wp-admin

source: This setting enables a fictive callback problem.
sv_se: Detta aktiverar ett fiktivt callback-problem.

source: Fail retrieval of priceinfo
sv_se: Misslyckad hämtning av priceinfo

source: Ensure that the priceinfo box still shows data when no data has been retrieved from priceinfo.
sv_se: Se till att prisinfoboxen fortfarande visar data när inga data har hämtats från priceinfo.

source: Fail fetching annuityFactor values
sv_se: Misslyckas med att hämta annuitetsfaktorvärden

source: wp-admin: Generate an exception in AJAX-based getPaymentMethods-requests
sv_se: wp-admin: Generera ett undantagsfel i AJAX-baserade getPaymentMethods-förfrågningar

source: This setting enables a fictive getPaymentMethods problem when we update payment methods in admin manually.
sv_se: Den här inställningen aktiverar ett fiktivt getPaymentMethods-problem när vi uppdaterar betalningsmetoder i admin manuellt.

source: wp-admin: getPaymentMethods will run without pre-stored data
sv_se: wp-admin: getPaymentMethods körs utan förhandslagrad data

source: This setting enables a fictive getPaymentMethods problem where we request for payment methods the first time. To test exceptions with the API update, this should be combined with the getPaymentMethods in AJAX-mock.
sv_se: Den här inställningen möjliggör ett fiktivt getPaymentMethods-problem där vi begär betalningsmetoder första gången. För att testa problem med API-uppdateringen bör detta kombineras med getPaymentMethods i AJAX-mock.

source: Fail update callbacks from Resurs Bank
sv_se: Misslyckas uppdatera callbacks från Resurs Bank

source: Emulate refunding error from Resurs Bank (annul/credit)
sv_se: Emulera återbetalningsfel från Resurs Bank (annullering/kreditering)

source: Emulating exceptions from SoapService in the annulPayment/creditPayment services.
sv_se: Emulera problem från SoapService i annulPayment/creditPayment-tjänsterna.

source: Private person
sv_se: Privatperson

source: Company
sv_se: Företag

source: Get address
sv_se: Hämta adress

source: Never.
sv_se: Aldrig.

source: Social security number
sv_se: Personnummer

source: Phone number
sv_se: Telefonnummer

source: Mobile number
sv_se: Mobilnummer

source: E-mail address
sv_se: Epost-adress

source: Applicant government id
sv_se: Sökande personnummer

source: Card number
sv_se: Kortnummer

source: Import of old credentials initiated.
sv_se: Import av gamla autentiseringsuppgifter initieras.

source: Import of old credentials finished.
sv_se: Import av gamla autentiseringsuppgifter slutförd.

source: Nonce validation accepted (from function: %s): %s.
sv_se: Validering av nonce accepterad (från funktion: %s): %s.

source: Price information request retrieved no content from Resurs Bank.
sv_se: Prisinformationsförfrågan hämtade inget innehåll från Resurs Bank.

source: While you were in the checkout, the cart has been updated somewhere else. If you have more tabs open in your browser, make sure you only use one of them during the payment. You may want to reload this page to make it right.
sv_se: Medan du var i kassan har varukorgen uppdaterats någon annanstans. Om du har fler flikar öppna i din webbläsare, se till att du bara använder en av dem under betalningen. Du kanske vill ladda om den här sidan för att ställa det till rätta.

source: Credentials validation from wp-admin initiated for environment %s, username request %s.
sv_se: Validering av inloggningsuppgifter från wp-admin initierades för miljö %s, begäran om användarnamn %s.

source: An error occured during credential checking: %s (%d).
sv_se: Ett fel uppstod under kontrollen av användaruppgifter: %s (%d).

source: Credential validation was successful and therefore saved.
sv_se: Valideringen av autentiseringsuppgifterna lyckades och sparades.

source: Resurs Bank credential validation for environment %s executed, response was %s.
sv_se: Resurs Banks validering av autentiseringsverifiering för %s exekverades, svaret var %s.

source: Resurs Bank SOAP-services is currently returning a valid XML-response.
sv_se: Resurs Bank SOAP-tjänster returnerar för närvarande ett giltigt XML-svar.

source: Connectivity may be a bit slower than normal.
sv_se: Anslutningen kan vara lite långsammare än normalt.

source: Advanced mode is disabled. You can not make this change.
sv_se: Avancerat läge är inaktiverat. Du kan inte göra den här ändringen.

source: Test activated.
sv_se: Test aktiverat.

source: Test failed to activate.
sv_se: Det gick inte att aktivera test.

source: Waiting.
sv_se: Väntar.

source: Received
sv_se: Mottagen

source: Waiting for callback TEST (%d seconds).
sv_se: Väntar på callback TEST (%d sekunder).

source: By phone request.
sv_se: Via telefonnummer.

source: By phone request failed, executed failover by government id.
sv_se: Via telefonnummer misslyckades, exekverade backuplösning för personnummer.

source: By government id/company id (See customer type).
sv_se: Via personnummer/organisationsnummer (Se kundtypen).

source: By government id/company id (See customer type), but failed: (%d) %s.
sv_se: Via personnummer/organisationsnummer (Se kundtypen), men misslyckades: (%d) %s.

source: getAddress request (country %s, type %s) for %s: %s
sv_se: getAddress förfrågan (land %s, typ %s) för %s: %s

source: Failed
sv_se: Misslyckades

source: Denied
sv_se: Nekad

source: Order was rejected with status "%s".
sv_se: Ordern avslogs med statusen "%s".

source: Please contact customer service for more information.
sv_se: Kontakta kundtjänst för mer information.

source: (Selected Environment: Test - Suggested contact method)
sv_se: (Vald miljö: Test - Föreslagen kontaktmetod)

source: (Selected Environment: Production - Suggested contact method)
sv_se: (Vald miljö: Produktion - Föreslagen kontaktmetod)

source: Plugin related questions and things that is not related to Resurs Bank.
sv_se: Pluginrelaterade frågor och saker som inte är relaterade till Resurs Bank.

source: Matters related to Resurs Bank in staging and test environments %s
sv_se: Frågor relaterade till Resurs Bank i staging och testmiljöer %s

source: Matters related to Resurs Bank in live production environments %s
sv_se: Ärenden relaterade till Resurs Bank i live produktionsmiljöer %s

source: Shipping
sv_se: Frakt

source: Refund/cancellation request for %d item(s) sent to Resurs Bank successfully.
sv_se: Begäran om återbetalning/annullering för %d vara/varor skickades till Resurs Bank utan problem.

source: Resurs Bank refunding error: %s (%s).
sv_se: Resurs Bank återbetalningsfel: %s (%s).

source: Success.
sv_se: Lyckades.

source: Failed without receiving any exception.
sv_se: Misslyckades utan att ta emot undantagsfel.

source: Queued Status Handler: Updated status for %s to %s with notice: %s
sv_se: Uppköad statushantering: Uppdaterar status för %s till %s med meddelande: %s
