Repository: Tornevall/tornevalls-resurs-bank-payment-gateway-for-woocommerce
Catalog: language/wp-plugins-tornevalls-resurs-bank-payment-gateway-for-woocommerce-stable-readme-*.po
Languages: sv

source: Tornevalls Resurs Bank Payment Gateway for WooCommerce.
sv: Tornevalls Resurs Bank betalningslösning för WooCommerce.

source: Tornevalls Resurs Bank payment gateway for WooCommerce
sv: Tornevalls Resurs Bank betalningslösning för WooCommerce

source: From time to time, you will notices that errors and exceptions shows up on your screen. Normally, when doing API calls, this is done by <a href="https://test.resurs.com/docs/pages/viewpage.action?pageId=5014349">Resurs Bank Ecommerce API for PHP</a>. Such messages can be traced by Resurs Bank support, if something is unclear but many times error messages are self explained. Resurs Bank also have furter information about some error messages. <a href="https://test.resurs.com/docs/display/ecom/Errors%2C+problem+solving+and+corner+cases">You can see some of them here</a>.
sv: Då och då kommer du att märka att fel och undantag visas på skärmen. Normalt sett, när du API-anrop utförs, görs detta av <a href="https://test.resurs.com/docs/pages/viewpage.action?pageId=5014349">Resurs Bank Ecommerce API för PHP</a>. Sådana meddelanden kan spåras av Resurs Bank support, om något är oklart men många gånger är felmeddelande självförklarande. Resurs Bank har mer information om dessa felmeddelanden. <a href="https://test.resurs.com/docs/display/ecom/Errors%2C+problem+solving+and+corner+cases">Du kan se några av dem här</a>.

source: No. This plugin is a complete reboot. The future intentions might be to replace the other version in the future and <strong>this</strong> release is currently considered a side project, <em>even if it has been developed by an employee</em> at Resurs Bank.
sv: Nej. Detta plugin är en fullständig "reboot". De framtida avsikterna kan vara att ersätta den andra versionen i framtiden och <strong>denna</strong> utgåva betraktas för närvarande som ett sidoprojekt, <em>även om det har utvecklats av en anställd</em> på Resurs Bank.

source: Many ideas are lifted straight out from the prior version - but not all of them. Remember, this is a third party reboot of an old release. There are settings in this version that is no longer working, especially features that is bound to filters and actions. For actions and filters, you can take a look at the <a href="https://docs.tornevall.net/x/HoC4Aw">documentation</a>. Further information about settings will come.
sv: Många idéer lyfts direkt från den tidigare versionen - men inte alla. Kom ihåg att detta är en omstart från en tredje part av en äldre version. Det finns inställningar i den här versionen som inte längre fungerar, särskilt funktioner som är bundna till filter och åtgärder. För actions och filter kan du ta en titt på <a href="https://docs.tornevall.net/x/HoC4Aw">dokumentationen</a>. Mer information om inställningar kommer.

source: I see an order but find no information connected to Resurs Bank
sv: Jag ser en order men hittar ingen information kopplad till Resurs Bank

source: What is a EComPHP API Message?
sv: Vad är ett EComPHP API-meddelande?

source: System prerequisites
sv: Systemförutsättningar

source: Part of the Order View.
sv: En del av ordervyn.

source: Part of the Payment Methods View.
sv: En del av vyn Betalningsmetoder.

source: Primary Basic Settings Configuration page.
sv: Konfigurationssida för primära grundläggande inställningar.

source: Examples of what could "break" is normally in the form of "no longer supported":
sv: Exempel på vad som kan "brytas" är normalt sett i form av "stöds ej längre":

source: Breaking changes are collected <a href="https://docs.tornevall.net/x/UwJzBQ">here</a>.
sv: Brytande förändringar samlas in <a href="https://docs.tornevall.net/x/UwJzBQ">här</a>.

source: Speaking of settings. Settings is almost similar to the old plugin, but with new identifiers. It is partially intentional done, so we don't collide with old settings. Some of them are also not very effective, so some of them has also been removed as they did no longer fill any purpose.
sv: På tal om inställningar. Inställningarna liknar nästan det gamla tillägget, men med nya identifierare. Det är delvis avsiktligt gjort, så att vi inte kolliderar med gamla inställningar. Vissa av dem är inte heller särskilt effektiva, så några av dem har också tagits bort eftersom de inte längre feller något syfte.

source: The prior payment method editor where title and description for each payment method could be edited. This is not really plugin side decided, but based on rules set by Resurs Bank. First of all, titles and descriptions are handled by Resurs Bank to simplify changes that is related to whatever could happen to a payment method. The same goes for the sorting of payment methods in the checkout. Some payment methods is regulated by laws and should be displayed in a certain order. This is no longer up to the plugin to decide and sorting is based on in which order Resurs Bank is returning them in the API. If you want anything changed, related to the payment method, you have to contact Resurs Bank support.
sv: Redigeraren för för betalningsmetoder där titel och beskrivning för varje betalningsmetod kan ändras. Detta är egentligen inte upp till tillägget att beslutas, utan baseras på regler som fastställts av Resurs Bank. Först och främst hanteras titlar och beskrivningar av Resurs Bank för att förenkla förändringar som är relaterade till vad som än kan hända med en betalningsmetod. Detsamma gäller sortering av betalningsmetoder i kassan. Vissa betalningsmetoder regleras av lagar och bör visas i en viss ordning. Det är inte längre upp till tillägget att bestämma, och sortering baseras på i vilken ordning Resurs Bank returnerar dem i API:et. Om du vill att något ska ändras, relaterat till betalningsmetoden, måste du kontakta Resurs Bank support.

source: What is considered "breaking changes"?
sv: Vad anses vara "brytande förändringar"?

source: <strong>First time running should be a dedicated test environment!</strong>
sv: <strong>Första gången du startar upp, bör vara i en dedikerad testmiljö!</strong>

source: WARNING
sv: VARNING

source: Full description about how "simplifiedShopFlow", "hosted flow" and "Resurs Checkout" works, not only here, but mostly anywhere can be seen at <a href="https://docs.tornevall.net/x/IAAkBQ">https://docs.tornevall.net/x/IAAkBQ</a>
sv: Fullständig beskrivning av hur "simplifiedShopFlow", "hosted flow" och "Resurs Checkout" fungerar, inte bara här, utan mestadels var som helst kan ses på <a href="https://docs.tornevall.net/x/IAAkBQ">https://docs.tornevall.net/x/IAAkBQ</a>

source: This is a common question about customer actions and how the order has been created/signed. Most of the details is usually placed in the order notes for the order, but if you need more information you could also consider contacting Resurs Bank support.
sv: Detta är en vanlig fråga om kundhändelser och hur ordern har skapats/signerats. De flesta uppgifterna placeras vanligtvis i orderanteckningarna för beställningen, men om du behöver mer information kan du också överväga att kontakta Resurs Banks support.

source: There are several reasons for the 40X errors, but if they are thrown from an EComPHP API message, there are few things to take in consideration:
sv: Det finns flera orsaker till 40X-felen, men om de kastas från ett EComPHP API-meddelande finns det ett antal saker att ta hänsyn till:

source: <strong>"Version 2.2.x"</strong> is currently the <strong>official Resurs Bank release</strong> and not the same as this release that is a practically a third party reboot. However, the intentions with this plugin is to run as seamless as possible. For example, payments placed with the prior release can be handled by this one.
sv: <strong>"Version 2.2.x"</strong> är för närvarande den <strong>officiella Resurs Bank-utgåvan</strong> och inte samma som den här utgåvan, som praktiskt taget är en omstart gjord av tredje part. Avsikterna med detta plugin är dock att användas så sömlöst som möjligt. Till exempel kan betalningar som placeras med den tidigare versionen även hanteras av den här.

source: You may visit <a href="https://docs.tornevall.net/x/CoC4Aw">docs.tornevall.net</a> for more information regarding the plugin. For questions about API and Resurs Bank please visit <a href="https://test.resurs.com/docs/">test.resurs.com/docs</a>.
sv: Du kan besöka <a href="https://docs.tornevall.net/x/CoC4Aw">docs.tornevall.net</a> för mer information om plugin. För frågor om API och Resurs Bank, besök <a href="https://test.resurs.com/docs/">test.resurs.com/docs</a>.

source: 403 = Forbidden. <strong>Cause</strong>: This is a bit be more common during testing. <strong>Solution:</strong> Resolution: Contact Resurs Bank for support.
sv: 403 = Förbjudet. <strong>Orsak</strong>: Detta är lite vanligare under testning. <strong>Lösning:</strong> Lösning: Kontakta Resurs Bank för support.

source: 401 = Unauthorized. <strong>Cause</strong>: Bad credentials <strong>Solution</strong>: Contact Resurs Bank support for support questions regarding API credentials.
sv: 401 = Obehörig. <strong>Orsak</strong>: Felaktiga autentiseringsuppgifter <strong>Lösning</strong>: Kontakta Resurs Banks support för supportfrågor om API-autentiseringsuppgifter.

source: How does the respective payment flows work with Resurs Bank in this plugin?
sv: Hur fungerar respektive betalningsflöde med Resurs Bank i detta tillägg?

source: Plugin is causing 40X errors on my site
sv: Tillägget orsakar 40X-fel på min webbplats

source: Is this release a refactored version of Resurs Bank's?
sv: Är denna version en refaktorerad version av Resurs Banks?

source: Can I upgrade from version 2.2.x?
sv: Kan jag uppgradera från version 2.2.x?

source: Where can I get more information about this plugin?
sv: Var kan jag få mer information om det här tillägget?

source: However, this plugin release should not be considered an official upgrade from "an older version" as there currently are no old versions available yet - except from the <em>official release</em> from Resurs Bank. For the moment, this is not the same thing.
sv: Denna plugin-utgåva bör dock inte betraktas som en officiell uppgradering från "en äldre version" eftersom det för närvarande inte finns några tidigare versioner tillgängliga ännu - förutom från den <em>officiella utgåvan</em> från Resurs Bank. För tillfället är detta inte samma sak.

source: When you install this plugin and eventually did use an older version, you will also get the opportunity to import the old credentials. For full documentation, take a look at <a href="https://docs.tornevall.net/x/CoC4Aw">https://docs.tornevall.net/x/CoC4Aw</a>
sv: När du installerar det här tillägget och så eventuellt har använt en äldre version, så får du också möjlighet att importera de gamla autentiseringsuppgifterna. För fullständig dokumentation, ta en titt på <a href="https://docs.tornevall.net/x/CoC4Aw">https://docs.tornevall.net/x/CoC4Aw</a>

source: Are you using this plugin as an upgrade from an older version? Feel free to do that; upgrading is meant to be seamless and should not lead to hard breaking changes. There might be configuration settings to take in consideration to look through, if they are still matching your own. This may be important especially if you have a custom setup.
sv: Använder du det här tillägget som en uppgradering från en äldre version? Gör gärna det; uppgradering är avsedd att vara sömlös och bör inte leda till att något bryts. Det kan finnas konfigurationsinställningar att ta hänsyn till att titta igenom, om de fortfarande matchar dina. Detta kan vara viktigt, särskilt om du har anpassat installationen.

source: Preferred Method is to install and activate the plugin through the WordPress plugin installer.
sv: Föredragen metod är att installera och aktivera tillägget via WordPress plugin-hanterare.

source: Configure the plugin via admin control panel
sv: Konfigurera tillägget via kontrollpanelen

source: Activate the plugin through the "Plugins" menu in WordPress
sv: Aktivera tillägget via menyn "Plugins" i WordPress

source: Upload the plugin archive to the "/wp-content/plugins/" directory
sv: Ladda upp tilläggspaketet till katalogen "/wp-content/plugins/"

source: If you'd like to contribute to this project, you can either sign up to <a href="https://github.com/Tornevall/wpwc-resurs/issues">github</a> and create an issue or use the old <a href="https://tracker.tornevall.net/projects/RWC">Bitbucket Project</a> to do this on. The full project status can be found <a href="https://tracker.tornevall.net/secure/Dashboard.jspa?selectPageId=11200">at this dashboard</a> since that's where the project started.
sv: Om du vill bidra till det här projektet kan du antingen registrera dig på <a href="https://github.com/Tornevall/wpwc-resurs/issues">github</a> och skapa ett ärende, eller använda det gamla <a href="https://tracker.tornevall.net/projects/RWC">Bitbucket-projektet</a> för att göra detta. Den fullständiga projektstatusen finns <a href="https://tracker.tornevall.net/secure/Dashboard.jspa?selectPageId=11200">på den här instrumentpanelen</a> eftersom det var där projektet startade.

source: Help with translation of the plugin by joining <a href="https://crwd.in/trwbc">Crowdin</a>!
sv: Hjälp till med översättning av tillägget genom att gå med i <a href="https://crwd.in/trwbc">Crowdin</a>!

source: Check out <a href="https://github.com/Tornevall/wpwc-resurs/blob/master/README.md">README.md</a> for more details. Documentation for this specific release is currently located at <a href="https://docs.tornevall.net/x/CoC4Aw">https://docs.tornevall.net/x/CoC4Aw</a>
sv: Kolla in <a href="https://github.com/Tornevall/wpwc-resurs/blob/master/README.md">README.md</a> för mer information. Dokumentation för den här specifika versionen finns för närvarande på <a href="https://docs.tornevall.net/x/CoC4Aw">https://docs.tornevall.net/x/CoC4Aw</a>

source: Primary new problems should be discovered in TEST rather than production since the costs are way lower, where no real people are depending on failed orders or payments. If something fails in production it also means that you are the one that potentially looses traffic while your site is down.
sv: Primära nya problem bör upptäckas i TEST snarare än produktion eftersom kostnaderna är mycket lägre, där inga riktiga människor är beroende av misslyckade köp eller betalningar. Om något misslyckas i produktionen betyder det också att du är den som potentiellt tappar trafik medan din webbplats är nere.

source: If you are entirely new to this plugin or WordPress overall, I'd suggest you to run it in a dedicated test environment that is supposedly <strong>equal</strong> to a production environment. Never run any tests in production!
sv: Om du är helt ny på detta tillägg eller WordPress överlag, föreslår jag att du kör det i en dedikerad testmiljö som antas är <strong>likadan</strong> som en produktionsmiljö. Kör aldrig några tester i produktionen!

source: The main responsibility that this product works properly with your system is yours. For <strong>your</strong> safety you should therefore <strong>TEST the plugin</strong> in a dedicated test environment <strong>before using it</strong> in a production.
sv: Huvudansvaret för att denna produkt fungerar korrekt ihop med ditt system är ditt. För <strong>din</strong> säkerhet bör du därför <strong>TESTA tillägget i</strong> en dedikerad testmiljö <strong>innan du använder den</strong> i en produktion.

source: See below for information about requirements.
sv: Se nedan för information om krav.

source: There is a publicly available release out supported by Resurs Bank (v2.2). There <strong>may be breaking changes</strong> if you plan to use <strong>this</strong> plugin as it was an upgrade from the Resurs Bank supported release, since the settings and filters have been replaced.
sv: Det finns en publikt tillgänglig version som har släppts av Resurs Bank (v2.2). Det <strong>kan finnas brytande ändringar</strong> om du planerar att använda <strong>det här</strong> tillägget som om det vore en uppgradering från Resurs Bank-stödda utgåvan, eftersom inställningarna och filtren har bytts ut.

source: <strong>SoapClient is required</strong> for all actions related to "after shop", debiting, refunding, annulments, and so on. Also, your site has to be fully reachable with SSL/HTTPS. <strong>For full list of requirements, look below.</strong>
sv: <strong>SoapClient krävs</strong> för alla händelser relaterade till "after shop", debitering, återbetalning, annulleringar och så vidare. Din webbplats måste också vara fullt nåbar med SSL / HTTPS. <strong>För fullständig lista över krav, se nedan.</strong>

source: Payment gateway for Resurs Bank AB with support for the most recent shop flows.
sv: Betalningsgateway för Resurs Bank AB med stöd för de senaste köpflödena.

source: WordPress: Preferably at least v5.5. It is highly recommended to go for the latest version as soon as possible if you're not already there. See <a href="https://make.wordpress.org/core/handbook/references/php-compatibility-and-wordpress-versions/">here</a> for more information.
sv: WordPress: Helst minst v5.5. Det rekommenderas starkt att gå upp till den senaste versionen så snart som möjligt om du inte redan är där. Se <a href="https://make.wordpress.org/core/handbook/references/php-compatibility-and-wordpress-versions/">här</a> för mer information.

source: PHP streams? Yes, you still need them since SoapClient is actually using it.
sv: PHP streams? Ja, du behöver dem fortfarande eftersom SoapClient använder det.

source: Curl is highly <strong>recommended</strong> but not necessary. We suggest that you do not trust only PHP streams on this one as you may loose important features if you run explicitly with streams.
sv: Curl <strong>rekommenderas starkt men</strong> inte nödvändigt. Vi föreslår att du inte bara litar på PHP-streams på den här eftersom du kan förlora viktiga funktioner om du kör explicit med strömmar.

source: <strong>Required</strong>: SSL - HTTPS <strong>must</strong> be <strong>fully</strong> enabled. This is a callback security measure, which is required from Resurs Bank.
sv: <strong>Krävs</strong>: SSL - HTTPS <strong>måste</strong> vara <strong>helt</strong> aktiverat. Detta är en säkerhetsåtgärd som berör callbacks, vilket krävs av Resurs Bank.

source: <strong>Required</strong>: <a href="https://php.net/manual/en/class.soapclient.php">SoapClient</a> with xml drivers and extensions.
sv: <strong>Krävs</strong>: <a href="https://php.net/manual/en/class.soapclient.php">SoapClient</a> med xml-drivrutiner och tillägg.

source: <strong>Required</strong>: WooCommerce: v3.5.0 or higher!
sv: <strong>Krävs</strong>: WooCommerce: v3.5.0 eller högre!

source: PHP: <a href="https://docs.woocommerce.com/document/server-requirements/">Take a look here</a> to keep up with support. As of aug 2021, both WooCommerce and WordPress is about to jump into 7.4 and higher. Also, <a href="https://wordpress.org/news/2019/04/minimum-php-version-update/">read here</a> for information about lower versions of PHP. This plugin is written for 7.0 or higher.
sv: PHP: <a href="https://docs.woocommerce.com/document/server-requirements/">Ta en titt här</a> för att hålla jämna steg med stödet. Från och med aug 2021 är både WooCommerce och WordPress på väg att hoppa in i 7.4 och högre. Läs också <a href="https://wordpress.org/news/2019/04/minimum-php-version-update/">här</a> för information om lägre versioner av PHP. Detta plugin är skrivet för 7.0 eller högre.

source: Contribute
sv: Bidra

source: Active/open issues can be found <a href="https://tracker.tornevall.net/projects/RWC/issues/">here</a> <a href="https://github.com/Tornevall/wpwc-resurs/issues">and here</a>. You can also <a href="https://tracker.tornevall.net/secure/Dashboard.jspa?selectPageId=11200">inspect the project status here</a>! Most recent <a href="https://github.com/Tornevall/wpwc-resurs/blob/master/CHANGELOG.md">CHANGELOG can be found here</a>.
sv: Aktiva/öppna frågor hittar du <a href="https://tracker.tornevall.net/projects/RWC/issues/">här</a> <a href="https://github.com/Tornevall/wpwc-resurs/issues">och här</a>. Du kan också <a href="https://tracker.tornevall.net/secure/Dashboard.jspa?selectPageId=11200">inspektera projektstatusen här</a>! Senaste <a href="https://github.com/Tornevall/wpwc-resurs/blob/master/CHANGELOG.md">CHANGELOG hittar du här</a>.

source: Spelling corrections, translations, etc.
sv: Stavningskorrigeringar, översättningar m.m.

source: Content information, readme's, assets and other updates.
sv: Innehållsinformation, readme-filer, tillgångar och andra uppdateringar.

source: <a href="https://tracker.tornevall.net/browse/RWC-298">RWC-298</a> - Extended test mode.
sv: <a href="https://tracker.tornevall.net/browse/RWC-298">RWC-298</a> - Utökat testläge.
